Revit 2027 API
BuiltInFailures.ElectricalFailures.ObjsDemolished Property
 Cannot assign [Element] to circuit. Objects that are demolished cannot be added to a circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ObjsDemolished { get; }
Public Shared ReadOnly Property ObjsDemolished As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ObjsDemolished {
	FailureDefinitionId^ get ();
}
static member ObjsDemolished : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace